import plugin from '../../../lib/plugins/plugin.js'
import { segment } from "oicq";
import uploadRecord from '../../yenai-plugin/model/uploadRecord.js'; // 需搭配椰奶插件高清语言
const jitang = {
  "啊哈哈": "啊哈哈",
  "鸡汤来了": "鸡汤来了",
  "菜都齐了": "菜都齐了",
  "怎么不吃": "怎么不吃",
  "嘿秀秀": "嘿秀秀",
  "开玩笑": "开玩笑",
  "趁热吃": "趁热吃",
  "不打扰": "不打扰",
  "我走了": "我走了",
  "呵呵呵": "呵呵呵",
  "鸡汤珍贵": "鸡汤珍贵",
  "同志们喝": "同志们喝",
  "我炊事员": "我炊事员",
  "不能喝": "不能喝",
  "嘿秀": "嘿秀",
  "这不对": "这不对",
  "谁要吓我": "谁要吓我",
  "你吓我？": "你吓我？",
  "啊？": "啊？",
  "行": "行",
  "我喝": "我喝",
  "喝": "喝",
  "喝汤多美": "喝汤多美",
  "哎呀～": "哎呀～",
  "不咸不淡": "不咸不淡",
  "味道真好": "味道真好",
  "看没事吧": "看没事吧",
  "嘿喝吧": "嘿喝吧",
  "趁热喝吧": "趁热喝吧",
  "你得带头": "你得带头",
  "你不喝": "你不喝",
  "他们不喝": "他们不喝",
  "看我干嘛": "看我干嘛",
  "喝喝呀": "喝喝呀",
  "快趁热喝": "快趁热喝",
  "趁热喝呀": "趁热喝呀",
  "他奶奶的": "他奶奶的",
  "干嘛不喝": "干嘛不喝",
  "喝喝啊": "喝喝啊",
  "不喝炸你": "不喝炸你",
  "都不敢喝": "都不敢喝",
  "都怕死": "都怕死",
  "我告诉你": "我告诉你",
  "不喝？": "不喝？",
  "别想活": "别想活",
  "大家知道": "大家知道",
  "我不演了": "我不演了",
  "我就是": "我就是",
  "重庆军统": "重庆军统",
  "日本双料": "日本双料",
  "高级特工": "高级特工",
  "代号": "代号",
  "穿山甲": "穿山甲",
  "鸡汤毒": "鸡汤毒",
  "是我放的": "是我放的",
  "这鸡汤": "这鸡汤",
  "我喝了": "我喝了",
  "我得死": "我得死",
  "你们不喝": "你们不喝",
  "别想活": "别想活",
  "龟爷先生": "龟爷先生",
  "地皇B下": "地皇B下",
  "我的任务": "我的任务",
  "完成了": "完成了",
  "哈哈": "哈哈",
  "哈哈2": "哈哈2",
  "奶奶的": "奶奶的",
  "玩阴的": "玩阴的",
  "那就来吧": "那就来吧",
}
const jireg = new RegExp(`^(${Object.keys(jitang).join("|")})$`)
export class example extends plugin {
  constructor() {
    super({
      name: '鸡汤盒',
      event: 'message',
      priority: 5000,
      rule: [
        {
          reg: jireg,
          fnc: 'jitang'
        },
        {
          reg: "^鸡汤盒$",
          fnc: 'help'
        }
      ]

    })
  }


  async jitang(e) {
    e.reply(await uploadRecord(`http://jilehe.125ks.cn/Voice/jth/res/${encodeURIComponent(jitang[e.msg])}.mp3`, 0, false))
  }
  async help(e) {
    e.reply(Object.keys(jitang).join("，"))
  }
}

